app/Controllers/Home.php

SELECT `santri`.`laznah`, `absensi`.*
FROM `absensi`
LEFT JOIN `santri` ON `santri`.`nip` = `absensi`.`nip`
WHERE `bulan` = 'Jun-2024'
SELECT *
FROM `kompetensi`
SELECT DISTINCT LEFT(tahun, 4) as tahun, COUNT(LEFT(tahun, 4)) as count
FROM `kompetensi`
GROUP BY LEFT(tahun, 4)
SELECT DISTINCT `jenis`, COUNT(jenis) as count
FROM `kompetensi`
GROUP BY `jenis`
SELECT COUNT(*) AS `numrows`
FROM `santri`
WHERE `status_santri` <> 'Suspend'
SELECT COUNT(*) AS `numrows`
FROM `absensi`
SELECT COUNT(*) AS `numrows`
FROM `tunjangan`
SELECT COUNT(*) AS `numrows`
FROM `potongan`
SELECT COUNT(*) AS `numrows`
FROM `santri`
WHERE `status_santri` <> 'Suspend'
AND `acc` = 1
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `acc` = 1
SELECT COUNT(*) AS `numrows`
FROM `tunjangan`
WHERE `acc` = 1
SELECT COUNT(*) AS `numrows`
FROM `potongan`
WHERE `acc` = 1
SELECT `laznah`, COUNT(laznah) as count, COALESCE(SUM(hadir), 0) as hadir, COALESCE(SUM(sakit), 0) as sakit, COALESCE(SUM(ijin), 0) as ijin, COALESCE(SUM(alpa), 0) as alpa
FROM `santri`
LEFT JOIN `absensi` ON `santri`.`nip` = `absensi`.`nip`
WHERE `status_santri` <> 'Suspend'
GROUP BY `laznah`
---
    public function index()
    {
        if (session()->get('uname')) {
            $santriModel = new SantriModel();
            $kompetensiModel = new KompetensiModel();
            $absensiModel = new AbsensiModel();
            $tunjanganModel = new TunjanganModel();
            $potonganModel = new PotonganModel();

            $data = [
                'santri' => $santriModel->where('status_santri <> ', 'Suspend')->findAll(),
                'absensi' => $absensiModel->where('bulan', date('M-Y', strtotime('-1 month')))->join('santri', 'santri.nip = absensi.nip', 'LEFT')->select('santri.laznah')->select('absensi.*')->findAll(),
                'kompetensi' => $kompetensiModel->findAll(),
                'kompetensiCount' => $kompetensiModel->select('DISTINCT LEFT(tahun,4) as tahun, COUNT(LEFT(tahun,4)) as count')->groupBy('LEFT(tahun,4)')->findAll(),
                'kompetensiJenis' => $kompetensiModel->select('jenis, COUNT(jenis) as count')
                        ->distinct()
                        ->groupBy('jenis')
                        ->findAll(),
                'jumlahSantri' => $santriModel->where('status_santri <> ', 'Suspend')->countAllResults(),
                'jumlahAbsensi' => $absensiModel->countAllResults(),
                'jumlahTunjangan' => $tunjanganModel->countAllResults(),
                'jumlahPotongan' => $potonganModel->countAllResults(),
                'accSantri' => $santriModel->where('status_santri <>', 'Suspend')
                         ->where('acc', true)
                         ->countAllResults(),
                'accAbsensi' => $absensiModel->where('acc', true)->countAllResults(),
                'accTunjangan' => $tunjanganModel->where('acc', true)->countAllResults(),
                'accPotongan' => $potonganModel->where('acc', true)->countAllResults(),
                'laznah' => $santriModel->join('absensi', 'santri.nip = absensi.nip', 'LEFT')->select('laznah, COUNT(laznah) as count, COALESCE(SUM(hadir),0) as hadir, COALESCE(SUM(sakit),0) as sakit, COALESCE(SUM(ijin),0) as ijin, COALESCE(SUM(alpa),0) as alpa')->where('status_santri <> ', 'Suspend')->groupBy('laznah')->findAll()