app/Controllers/OfficePengurus.php

SELECT *
FROM `santri`
ORDER BY `status_santri`
SELECT *
FROM `user`
WHERE `uname` = 'devi'
 LIMIT 1
---
    public function index()
    {
        // $keyword = $this->request->getVar('keyword');
        // if ($keyword) {
        //     $santri = $this->santriModel->search($keyword);
        // } else {
        //     $santri = $this->santriModel;
        // }

        $data = [
            // 'santri' => $this->santriModel->where('status_santri <> ', 'Suspend')->findAll(),
            'santri' => $this->santriModel->orderBy('status_santri')->findAll(),
            'user' => $this->userModel->where('uname', session()->get('uname'))->first()

SELECT *
FROM `santri`
WHERE `santri`.`id` = '4'
UPDATE `santri` SET `acc` = 1
WHERE `id` = '4'
---
    public function ceklis($id)
    {
        if ($this->request->isAJAX()) {
            $santri =  $this->santriModel->find($id);

            if ($santri['acc']) {
                $this->santriModel->set('acc', false);
                $acc = false;
            } else {
                $this->santriModel->set('acc', true);
                $acc = true;
            }

            $this->santriModel->where('id', $id);
            $this->santriModel->update();