app/Controllers/OfficeAbsensi.php

    public function index($bln = NULL)
    {
        // $unlist = $this->santriModel->join('absensi', 'santri.nip=absensi.nip', 'LEFT')
        //     ->select('santri.id')->select('santri.nip')->select('santri.nama')->select('santri.laznah')
        //     ->where('santri.status_santri <> ', 'Suspend')->where('absensi.nip', NULL)->findAll();

        $db = \Config\Database::connect();
        $unlist = $db->query("SELECT santri.id, santri.nip, santri.nama, santri.laznah FROM santri LEFT JOIN absensi ON santri.nip=absensi.nip AND absensi.bulan='$bln' WHERE santri.status_santri<>'Suspend' AND absensi.nip is null")->getResultArray();

        $distLaznah = $this->santriModel
            ->distinct()
            ->select('laznah')
            ->orderBy('laznah')
            ->findAll();
---
SELECT DISTINCT `laznah`
FROM `santri`
ORDER BY `laznah`

    public function ceklis($id)
    {
        if ($this->request->isAJAX()) {
            $absensi =  $this->absensiModel->find($id);

            if ($absensi['acc']) {
                $this->absensiModel->set('acc', false);
                $acc = false;
            } else {
                $this->absensiModel->set('acc', true);
                $acc = true;
            }

            $this->absensiModel->where('id', $id);
            $this->absensiModel->update();
---
SELECT *
FROM `absensi`
WHERE `absensi`.`id` = '696'
UPDATE `absensi` SET `acc` = 0
WHERE `id` = '696'

    public function data($id)
    {
        $data = ['absensi' => $this->absensiModel->find($id)];
---
SELECT *
FROM `absensi`
WHERE `absensi`.`id` = '689'

    public function update($id)
    {
        $data = [
            'nip' => $this->request->getVar('nip'),
            'nama' => $this->request->getVar('nama'),
            'bulan' => $this->request->getVar('bulan'),
            'hari' => $this->request->getVar('hari'),
            'sakit' => $this->request->getVar('sakit'),
            'ijin' => $this->request->getVar('ijin'),
            'alpa' => $this->request->getVar('alpa'),
            'hadir' => $this->request->getVar('hadir'),
            'p_hadir' => $this->request->getVar('p_hadir'),
            'lambat' => $this->request->getVar('lambat'),
            'p_lambat' => $this->request->getVar('p_lambat'),
            'lembur' => $this->request->getVar('lembur'),
            'p_lembur' => $this->request->getVar('p_lembur'),
            'total' => $this->request->getVar('total'),
            'acc' => false
        ];
        $this->absensiModel->update($id, $data);
---
UPDATE `absensi` SET `nip` = '007.12.2017', `nama` = 'Maulana Shidik', `bulan` = NULL, `hari` = '26', `sakit` = '1', `ijin` = '2', `alpa` = '1', `hadir` = '22', `p_hadir` = '84.62', `lambat` = '5', `p_lambat` = '1.92', `lembur` = '0', `p_lembur` = '0.00', `total` = '0.80', `acc` = 0
WHERE `absensi`.`id` IN ('689')

    public function delete($id, $bln)
    {
        $this->absensiModel->delete($id);
---
DELETE FROM `absensi`
WHERE `id` IN ('165')

                    'p_lembur' => $abs[13],
                    'total' => $abs[14],
                ];
                $this->absensiModel->insert($data);
---
INSERT INTO `absensi` (`nip`, `nama`, `bulan`, `hari`, `sakit`, `ijin`, `alpa`, `hadir`, `p_hadir`, `lambat`, `p_lambat`, `lembur`, `p_lembur`, `total`) VALUES ('008.12.2017', 'Euis Sholihatunnisya', 'Sep-2022', '26', '1', '0', '0', '25', '96.15', '2', '0.77', '2', '7.69', '0.96')