app/Controllers/RemunProses.php

    public function loadData($bln, $ni = 0)
    {
        $santri = $this->santriModel->where('status_santri <> ', 'Suspend')->orderby('laznah', 'nama')->asArray()->findAll();
        foreach ($santri as $s) {
            $nip = $s['nip'];
            $grade = $s['grade'];
            $lama = date('Y') - $s['thn_gabung'] + 1;
            $loy = $this->loyal($lama);
            $skim = $this->skimModel->find($grade);
            $absensi = $this->absensiModel->where('nip', $nip)->where('bulan', $bln)->first();
            if ($absensi) {
                $honor = ($s['status_santri'] == 'Aktif' && $s['status_rda'] == 'Khidmat' && $lama >= 1) ? $skim['honor'] * $loy : 0;
                $makan = ($s['status_santri'] == 'Aktif' && $lama >= 1 && $absensi['total'] >= 0.9) ? $skim['makan'] : (($s['status_santri'] == 'Aktif' && $lama >= 1) ? round($skim['makan'] * $absensi['total'], -3) : 0);
                $transport = ($s['status_santri'] == 'Aktif' && $lama >= 1 && $absensi['total'] >= 0.9) ? $skim['makan'] : (($s['status_santri'] == 'Aktif' && $lama >= 1) ? round($skim['transport'] * $absensi['total'], -3) : 0);
            } else {
                $honor = 0;
                $makan = 0;
                $transport = 0;
            }
            $tunj = $this->tunjanganModel->where('nip', $nip)->first();
            $pot = $this->potonganModel->where('nip', $nip)->first();
            $tunjangan = (!$tunj) ? 0 : $tunj['t_jab'] + $tunj['t_stt'] + $tunj['t_ank'] + $tunj['t_rmh'] + $tunj['t_prg'] + $tunj['t_srg'] + $tunj['t_atr'] + $tunj['t_kes'] + $tunj['t_hra'] + $tunj['t_haj'] + $tunj['t_dka'] + $tunj['t_bns'] + $tunj['t_spc'] + $tunj['t_eks'];
            $potongan = (!$pot) ? 0 : $pot['p_srg'] + $pot['p_atr'] + $pot['p_kes'] + $pot['p_rmh'] + $pot['p_bon'] + $pot['p_htg'] + $pot['p_inf'] + $pot['p_lin'];
            $total = ($honor + $makan + $transport + $tunjangan) - $potongan;
            $zakat = (!$pot) ? 0 : round((($pot['p_zkt'] == 0) ? $total * 0.025 : $pot['p_zkt']), -3);
            $total = $total - $zakat;
            $remun = $this->remunModel->where('nip', $nip)->where('bulan', $bln)->first();
---
SELECT *
FROM `santri`
WHERE `status_santri` <> 'Suspend'
ORDER BY `laznah`
SELECT *
FROM `skim`
WHERE `skim`.`id` = '4'
SELECT *
FROM `absensi`
WHERE `nip` = '033.12.2019'
AND `bulan` = 'Jun-2024'
 LIMIT 1
SELECT *
FROM `tunjangan`
WHERE `nip` = '033.12.2019'
 LIMIT 1
SELECT *
FROM `potongan`
WHERE `nip` = '033.12.2019'
 LIMIT 1
SELECT *
FROM `remun`
WHERE `nip` = '033.12.2019'
AND `bulan` = 'Jun-2024'
 LIMIT 1

            $data['ext'] =
                [
                    'data' => $this->santriModel->where('status_santri <> ', 'Suspend')->countAllResults() + $this->absensiModel->countAllResults() + $this->tunjanganModel->countAllResults() + $this->potonganModel->countAllResults(),
                    'acc' => $this->santriModel->where('status_santri <> ', 'Suspend')->where('acc', true)->countAllResults() + $this->absensiModel->where('acc', true)->countAllResults() + $this->tunjanganModel->where('acc', true)->countAllResults() + $this->potonganModel->where('acc', true)->countAllResults(),
                    'not' => $this->santriModel->where('status_santri <> ', 'Suspend')->where('acc', false)->countAllResults() + $this->absensiModel->where('bulan', $bln)->where('acc', false)->countAllResults() + $this->tunjanganModel->where('acc', false)->countAllResults() + $this->potonganModel->where('acc', false)->countAllResults(),
                    'santri' => $this->santriModel->where('status_santri <> ', 'Suspend')->countAllResults(),
                    'remun' => $this->remunModel->where('bulan', $bln)->countAllResults(),
                    'absensi' => $this->absensiModel->where('bulan', $bln)->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `acc` = 1
SELECT COUNT(*) AS `numrows`
FROM `potongan`
WHERE `acc` = 1
SELECT COUNT(*) AS `numrows`
FROM `santri`
WHERE `status_santri` <> 'Suspend'
AND `acc` = 1
SELECT COUNT(*) AS `numrows`
FROM `tunjangan`
WHERE `acc` = 1
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `bulan` = 'Jun-2024'
AND `acc` = 0
SELECT COUNT(*) AS `numrows`
FROM `potongan`
WHERE `acc` = 0
SELECT COUNT(*) AS `numrows`
FROM `tunjangan`
WHERE `acc` = 0
SELECT COUNT(*) AS `numrows`
FROM `santri`
WHERE `status_santri` <> 'Suspend'
SELECT COUNT(*) AS `numrows`
FROM `remun`
WHERE `bulan` = 'Jun-2024'
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `bulan` = 'Jun-2024'