app/Controllers/RemunTunjangan.php

    public function index()
    {
        $unlist = $this->santriModel->join('tunjangan', 'santri.nip = tunjangan.nip', 'LEFT')
            ->select('santri.id')->select('santri.nip')->select('santri.nama')->select('santri.laznah')
            ->where('santri.status_santri <> ', 'Suspend')->where('tunjangan.nip', NULL)->findAll();

        $distLaznah = $this->santriModel->distinct()->select('laznah')->orderby('laznah')->findAll();

        $data = [
            'santri' => $unlist,
            'laznah' => $distLaznah,
            'tunjangan' => $this->tunjanganModel->findAll(),
            'user' => $this->userModel->where('uname', session()->get('uname'))->first()
---
SELECT `santri`.`id`, `santri`.`nip`, `santri`.`nama`, `santri`.`laznah`
FROM `santri`
LEFT JOIN `tunjangan` ON `santri`.`nip` = `tunjangan`.`nip`
WHERE `santri`.`status_santri` <> 'Suspend'
AND `tunjangan`.`nip` IS NULL
SELECT DISTINCT `laznah`
FROM `santri`
ORDER BY `laznah`
SELECT *
FROM `tunjangan`
SELECT *
FROM `user`
WHERE `uname` = 'abu.kafa'
 LIMIT 1

    public function ceklis($id)
    {
        if ($this->request->isAJAX()) {
            $tunjangan =  $this->tunjanganModel->find($id);

            if ($tunjangan['acc']) {
                $this->tunjanganModel->set('acc', false);
                $acc = false;
            } else {
                $this->tunjanganModel->set('acc', true);
                $acc = true;
            }

            $this->tunjanganModel->where('id', $id);
            $this->tunjanganModel->update();
---
SELECT *
FROM `tunjangan`
WHERE `tunjangan`.`id` = '3'
UPDATE `tunjangan` SET `acc` = 0
WHERE `id` = '3'