app/Controllers/RemunSkim.php

SELECT *
FROM `user`
WHERE `uname` = 'devi'
 LIMIT 1
---
    public function index()
    {
        $data = [
            'skim' => $this->skimModel->findAll(),
            'user' => $this->userModel->where('uname', session()->get('uname'))->first()

SELECT *
FROM `skim`
WHERE `skim`.`id` = '0'
UPDATE `skim` SET `acc` = 0
WHERE `id` = '0'
---
    public function ceklis($id)
    {
        if ($this->request->isAJAX()) {
            $skim =  $this->skimModel->find($id);

            if ($skim['acc']) {
                $this->skimModel->set('acc', false);
                $acc = false;
            } else {
                $this->skimModel->set('acc', true);
                $acc = true;
            }

            $this->skimModel->where('id', $id);
            $this->skimModel->update();

UPDATE `skim` SET `golongan` = NULL, `sub_golongan` = NULL, `honor` = 0, `makan` = 0, `transport` = 0, `t_jab` = 0, `t_stt` = 0, `t_ank` = 0, `t_prg` = 0, `t_kes` = 0, `acc` = 0
WHERE `skim`.`id` IN ('0')
---
    public function update($id)
    {
        $data = [
            'golongan' => $this->request->getVar('golongan'),
            'sub_golongan' => $this->request->getVar('sub_golongan'),
            'honor' => (int)$this->request->getVar('honor'),
            'makan' => (int)$this->request->getVar('makan'),
            'transport' => (int)$this->request->getVar('transport'),
            't_jab' => (int)$this->request->getVar('t_jab'),
            't_stt' => (int)$this->request->getVar('t_stt'),
            't_ank' => (int)$this->request->getVar('t_ank'),
            't_prg' => (int)$this->request->getVar('t_prg'),
            't_kes' => (int)$this->request->getVar('t_kes'),
            'acc' => false
        ];
        $this->skimModel->update($id, $data);