app/Controllers/RemunPotongan.php

    public function index()
    {
        $unlist = $this->santriModel->join('potongan', 'santri.nip = potongan.nip', 'LEFT')
            ->select('santri.id')->select('santri.nip')->select('santri.nama')->select('santri.laznah')
            ->where('santri.status_santri <> ', 'Suspend')->where('potongan.nip', NULL)->findAll();

        $distLaznah = $this->santriModel->distinct()->select('laznah')->orderby('laznah')->findAll();

        $data = [
            'santri' => $unlist,
            'laznah' => $distLaznah,
            'potongan' => $this->potonganModel->findAll(),
            'user' => $this->userModel->where('uname', session()->get('uname'))->first()
---
SELECT `santri`.`id`, `santri`.`nip`, `santri`.`nama`, `santri`.`laznah`
FROM `santri`
LEFT JOIN `potongan` ON `santri`.`nip` = `potongan`.`nip`
WHERE `santri`.`status_santri` <> 'Suspend'
AND `potongan`.`nip` IS NULL
SELECT DISTINCT `laznah`
FROM `santri`
ORDER BY `laznah`
SELECT *
FROM `potongan`
SELECT *
FROM `user`
WHERE `uname` = 'abu.kafa'
 LIMIT 1

    public function ceklis($id)
    {
        if ($this->request->isAJAX()) {
            $potongan =  $this->potonganModel->find($id);

            if ($potongan['acc']) {
                $this->potonganModel->set('acc', false);
                $acc = false;
            } else {
                $this->potonganModel->set('acc', true);
                $acc = true;
            }

            $this->potonganModel->where('id', $id);
            $this->potonganModel->update();
---
SELECT *
FROM `potongan`
WHERE `potongan`.`id` = '0'
UPDATE `potongan` SET `acc` = 0
WHERE `id` = '0'